In [19]:
import pandas as pd
import numpy as np

In [2]:
list1 = ["Harish","Shweta","Sravan"]
type(list1)

list

In [3]:
list1

['Harish', 'Shweta', 'Sravan']

In [4]:
#Convert to Series
ser = pd.Series(list1)
ser

0    Harish
1    Shweta
2    Sravan
dtype: object

In [5]:
type(ser)

pandas.core.series.Series

In [6]:
myTuple = (11,12,13)
type(myTuple)

tuple

In [7]:
ser2 = pd.Series(myTuple)

In [8]:
ser2

0    11
1    12
2    13
dtype: int64

In [9]:
ser

0    Harish
1    Shweta
2    Sravan
dtype: object

In [10]:
ser[1]

'Shweta'

In [11]:
ser.iloc[1]

'Shweta'

In [12]:
list1

['Harish', 'Shweta', 'Sravan']

In [13]:
inx = ['id1','id2','id3']
ser = pd.Series(list1,inx)
ser

id1    Harish
id2    Shweta
id3    Sravan
dtype: object

In [14]:
ser["id2"]

'Shweta'

In [15]:
ser.loc["id2"]

'Shweta'

In [16]:
ser.iloc[1]

'Shweta'

In [20]:
a = [9,10,8] #m,s,e
b = [8,8,7] #s,e,m
np.add(a,b)

array([17, 18, 15])

In [22]:
ser_a = pd.Series(a,['m','s','e'])
ser_b = pd.Series(b,['s','e','m'])

In [23]:
ser_a

m     9
s    10
e     8
dtype: int64

In [24]:
ser_b

s    8
e    8
m    7
dtype: int64

In [25]:
ser_a + ser_b

e    16
m    16
s    18
dtype: int64

In [27]:
ser = pd.Series(list1, name="Employee Names")
ser

0    Harish
1    Shweta
2    Sravan
Name: Employee Names, dtype: object

### DataFrame

In [28]:
emp_dt = {"empName": ["Ram","Shyam","Komal","Arushi"], "salary":[11,14,9,18]}
type(emp_dt)

dict

In [29]:
emp_dt

{'empName': ['Ram', 'Shyam', 'Komal', 'Arushi'], 'salary': [11, 14, 9, 18]}

In [30]:
#Covert to dataframe
df = pd.DataFrame(emp_dt)

In [31]:
df

  empName  salary
0     Ram      11
1   Shyam      14
2   Komal       9
3  Arushi      18

In [32]:
#Accessing sinle column
df["empName"]

0       Ram
1     Shyam
2     Komal
3    Arushi
Name: empName, dtype: object

In [34]:
df.empName

0       Ram
1     Shyam
2     Komal
3    Arushi
Name: empName, dtype: object

In [33]:
df["empName"].values #type cast to array

array(['Ram', 'Shyam', 'Komal', 'Arushi'], dtype=object)

In [35]:
df.empName.values

array(['Ram', 'Shyam', 'Komal', 'Arushi'], dtype=object)

In [36]:
#Accessing multiple columns
df[["empName","salary"]]

  empName  salary
0     Ram      11
1   Shyam      14
2   Komal       9
3  Arushi      18

In [37]:
df = pd.DataFrame(emp_dt,index=[11,12,13,14])
df

   empName  salary
11     Ram      11
12   Shyam      14
13   Komal       9
14  Arushi      18

### Slicing

In [38]:
df

   empName  salary
11     Ram      11
12   Shyam      14
13   Komal       9
14  Arushi      18

In [39]:
df.head(2)

   empName  salary
11     Ram      11
12   Shyam      14

In [40]:
df.tail(2)

   empName  salary
13   Komal       9
14  Arushi      18

In [41]:
df.loc[12:13]

   empName  salary
12   Shyam      14
13   Komal       9

In [42]:
df.iloc[1:3]

   empName  salary
12   Shyam      14
13   Komal       9

In [43]:
df1 = df
df1

   empName  salary
11     Ram      11
12   Shyam      14
13   Komal       9
14  Arushi      18

In [46]:
df2 = pd.DataFrame({"Leaves":[10,20,10,8]},index=[11,12,13,15])
df2

    Leaves
11      10
12      20
13      10
15       8

In [50]:
#left join
new_df = df1.join(df2)
new_df

   empName  salary  Leaves
11     Ram      11    10.0
12   Shyam      14    20.0
13   Komal       9    10.0
14  Arushi      18     NaN

In [48]:
#right join
df2.join(df1)

    Leaves empName  salary
11      10     Ram    11.0
12      20   Shyam    14.0
13      10   Komal     9.0
15       8     NaN     NaN

In [51]:
new_df

   empName  salary  Leaves
11     Ram      11    10.0
12   Shyam      14    20.0
13   Komal       9    10.0
14  Arushi      18     NaN

In [54]:
#Changing the column to index label
new_df.set_index("empName",inplace=True)

In [55]:
new_df

         salary  Leaves
empName
Ram          11    10.0
Shyam        14    20.0
Komal         9    10.0
Arushi       18     NaN

In [56]:
df

   empName  salary
11     Ram      11
12   Shyam      14
13   Komal       9
14  Arushi      18

In [57]:
df.index = df["empName"]

In [58]:
df

        empName  salary
empName
Ram         Ram      11
Shyam     Shyam      14
Komal     Komal       9
Arushi   Arushi      18

In [59]:
df.insert(1, "height", [172, 181, 185, 169]) #insert new column

In [60]:
df

        empName  height  salary
empName
Ram         Ram     172      11
Shyam     Shyam     181      14
Komal     Komal     185       9
Arushi   Arushi     169      18

In [61]:
df1

        empName  height  salary
empName
Ram         Ram     172      11
Shyam     Shyam     181      14
Komal     Komal     185       9
Arushi   Arushi     169      18

In [62]:
df2

    Leaves
11      10
12      20
13      10
15       8

In [66]:
df1 = pd.DataFrame(emp_dt)
df1

  empName  salary
0     Ram      11
1   Shyam      14
2   Komal       9
3  Arushi      18

In [67]:
df2 = pd.DataFrame({"Address":['RR Nagar','Mg Road','jayanagar','Indiranagar']})
df2

       Address
0     RR Nagar
1      Mg Road
2    jayanagar
3  Indiranagar

In [69]:
#concat operation
data = pd.concat((df1,df2),axis=1)

In [70]:
data

  empName  salary      Address
0     Ram      11     RR Nagar
1   Shyam      14      Mg Road
2   Komal       9    jayanagar
3  Arushi      18  Indiranagar

In [73]:
data.sort_values(by="salary") #sorting data

  empName  salary      Address
2   Komal       9    jayanagar
0     Ram      11     RR Nagar
1   Shyam      14      Mg Road
3  Arushi      18  Indiranagar

In [77]:
#Save data
data

  empName  salary      Address
0     Ram      11     RR Nagar
1   Shyam      14      Mg Road
2   Komal       9    jayanagar
3  Arushi      18  Indiranagar

In [78]:
data.to_csv('myData.csv')

In [79]:
data.to_html('myData.html')

In [80]:
#Loading a data
new_data = pd.read_csv("myData.csv")

In [81]:
new_data

   Unnamed: 0 empName  salary      Address
0           0     Ram      11     RR Nagar
1           1   Shyam      14      Mg Road
2           2   Komal       9    jayanagar
3           3  Arushi      18  Indiranagar

In [86]:
new_data.shape

(4, 4)

In [84]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      int64
 1   empName     4 non-null      object
 2   salary      4 non-null      int64
 3   Address     4 non-null      object
dtypes: int64(2), object(2)
memory usage: 256.0+ bytes

In [87]:
new_data.describe()

       Unnamed: 0    salary
count    4.000000   4.00000
mean     1.500000  13.00000
std      1.290994   3.91578
min      0.000000   9.00000
25%      0.750000  10.50000
50%      1.500000  12.50000
75%      2.250000  15.00000
max      3.000000  18.00000